def вага_на_місяці_функця(вага_на_землі, збільшеня, кількість_років):
    for рік in range(0, кількість_років):
        вага_на_місяці = вага_на_землі * 0.165
        print("рік:", рік, "Я важу на землі", вага_на_землі, "кг, а на місяці", вага_на_місяці, "кг")
        вага_на_землі = вага_на_землі + збільшеня


вага_на_землі = int(input("вага_на_землі:"))
збільшеня = float(input("збільшуваня ваги що року:"))
кількість_років = int(input("кількість_років:"))


вага_на_місяці_функця(вага_на_землі, збільшеня, кількість_років)


