class Жирафи():

    def ліва_нога_вперет(self):
        print("ліва нога вперет")

    def ліва_нога_назат(self):
        print("ліва нога назат")

    def ліва_нога_вперет(self):
        print("ліва нога вперет")

    def ліва_нога_назат(self):
        print("ліва нога назат")

    def права_нога_вперет(self):
        print("права нога вперет")

    def права_нога_назат(self):
        print("права нога назат")

    def права_нога_вперет(self):
        print("права нога вперет")

    def права_нога_назат(self):
        print("права нога назат")

    def ліва_нога_вперет(self):
        print("ліва нога вперет")

    def ліва_нога_назат(self):
        print("ліва нога назат")

    def права_нога_вперет(self):
        print("права нога вперет")

    def права_нога_назат(self):
        print("права нога назат")

    def танцювати(self):
        self.ліва_нога_вперет()
        self.ліва_нога_назат()
        self.ліва_нога_вперет()
        self.ліва_нога_назат()
        self.права_нога_вперет()
        self.права_нога_назат()
        self.права_нога_вперет()
        self.права_нога_назат()
        self.ліва_нога_вперет()
        self.ліва_нога_назат()
        self.права_нога_вперет()
        self.права_нога_назат()

#####################################

реджеральд = Жирафи()
реджеральд2 = Жирафи()

реджеральд.танцювати()
реджеральд2.танцювати()
