приховане_повідомленя = ["це",
                         "якщо",
                         "не",
                         "ти",
                         "дуже",
                         "це",
                         "хороший",
                         "чітаєш",
                         "спосіб",
                         "то",
                         "заховати",
                         "щось",
                         "повідомленя",
                         "негаразд"]


print("приховане повідомленя: %s" % приховане_повідомленя)
print("повідомленя 1:")
print(приховане_повідомленя[0])
print(приховане_повідомленя[2])
print(приховане_повідомленя[4])
print(приховане_повідомленя[6])
print(приховане_повідомленя[8])
print(приховане_повідомленя[10])
print(приховане_повідомленя[12])
print("")
print(".............")
print("")

print("повідомленя 2:")
print(приховане_повідомленя[1])
print(приховане_повідомленя[3])
print(приховане_повідомленя[5])
print(приховане_повідомленя[7])
print(приховане_повідомленя[9])
print(приховане_повідомленя[11])
print(приховане_повідомленя[13])